# Hапишіть программу "Касир в кінотеатрі", яка буде виконувати наступне:
# Попросіть користувача ввести свсвій вік.
# - якщо користувачу менше 7 - вивести "Тобі ж <>! Де твої батьки?"
# - якщо користувачу менше 16 - вивести "Тобі лише <>, а це е фільм для дорослих!"
# - якщо користувачу більше 65 - вивести "Вам <>? Покажіть пенсійне посвідчення!"
# - якщо вік користувача містить 7 - вивести "Вам <>, вам пощастить"
# - у будь-якому іншому випадку - вивести "Незважаючи на те, що вам <>, білетів всеодно нема!"
# Замість <> в кожну відповідь підставте значення віку (цифру) та правильну форму слова рік
# Для будь-якої відповіді форма слова "рік" має відповідати значенню віку користувача (1 - рік, 22 - роки, 35 - років і тд...).
# Наприклад :
# "Тобі ж 5 років! Де твої батьки?"
# "Вам 81 рік? Покажіть пенсійне посвідчення!"
# "Незважаючи на те, що вам 42 роки, білетів всеодно нема!"
# Зробіть все за допомогою функцій! Не забувайте що кожна функція має виконувати тільки одне завдання і про правила написання


def get_age(paceholder_message: str) -> int:
    while True:
        try:
            age = int(input(paceholder_message))
        except:
            print("Ви ввели не коректні дані, спробуйте ще!")
        else:
            if age > 0:
                break
            else:
                print('Ввудений вік повинен бути більший \'0\', спробуй ще!')

    return age


def checking_age_multiplicity(age: int) -> str:
    if 2 <= age % 10 <= 4:
        return 'роки'
    elif age % 10 == 1 and age != 11:
        return 'рік'
    else:
        return 'років'


def cheking_age():
    age = get_age('Введіть ваш вік: ')
    age_multiplicity = checking_age_multiplicity(age)

    if age % 10 == 7:
        print(f'Вам {age} {age_multiplicity}, вам пощастить!')
    elif 0 < age <= 7:
        print(f'Тобі ж {age} {age_multiplicity}! Де твої батьки?')
    elif age < 16:
        print(f'Тобі лише {age} {age_multiplicity}, а це е фільм для дорослих!')
    elif age > 65:
        print(f'Вам {age} {age_multiplicity}? Покажіть пенсійне посвідчення!')
    else:
        print(f'Незважаючи на те, що вам {age} {age_multiplicity}, білетів всеодно немає!')


cheking_age()


